#!/bin/zsh
#
# .zsh_plugins.txt - antidote plugins file
#

### Overview
#
# Please refer to https://github.com/getantidote/zdotdir/blob/main/.zsh_plugins.txt
#
###

### Completions
zsh-users/zsh-completions path:src kind:fpath
mattmc3/ez-compinit


### Regular Plugins
peterhurford/up.zsh
rummik/zsh-tailf
mattmc3/zman
agkozak/zsh-z
z-shell/zsh-eza


### Local Plugins
$ZDOTDIR/.aliases
#$ZDOTDIR/custom/plugins/example


### Prompts
romkatv/powerlevel10k


### Utilities
# romkatv/zsh-bench kind:path


### Frameworks

### Framework: Oh-My-Zsh
getantidote/use-omz
ohmyzsh/ohmyzsh path:lib/clipboard.zsh
ohmyzsh/ohmyzsh path:plugins/copybuffer
ohmyzsh/ohmyzsh path:plugins/copyfile
ohmyzsh/ohmyzsh path:plugins/copypath
ohmyzsh/ohmyzsh path:plugins/extract
ohmyzsh/ohmyzsh path:plugins/magic-enter
# ohmyzsh/ohmyzsh path:plugins/fancy-ctrl-z

### Framework: zsh-utils
belak/zsh-utils path:history
belak/zsh-utils path:utility
belak/zsh-utils path:editor


### Deferred Plugins
zdharma-continuum/fast-syntax-highlighting kind:defer


### Final Plugins
zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search
